33yes/FreeRTOS_stm32_esp8266_Env_Scan/Net/src/mqtt.c
#include "stm32f10x.h"    
#include "mqtt.h"         
#include "string.h"       
#include "stdio.h"             
#include "esp8266.h"
#include "AT24C02.h"
#include "stdlib.h"

unsigned char  MQTT_RxDataBuf[R_NUM][RBUFF_UNIT];  //数据的接收缓冲区,所有服务器发来的数据，存放在该缓冲区,缓冲区第一个字节存放数据长度
unsigned char *MQTT_RxDataInPtr;                   //指向接收缓冲区存放数据的位置
unsigned char *MQTT_RxDataOutPtr;                  //指向接收缓冲区读取数据的位置
unsigned char *MQTT_RxDataEndPtr;                  //指向接收缓冲区结束的位置

unsigned char  MQTT_TxDataBuf[T_NUM][TBUFF_UNIT];  //数据的发送缓冲区,所有发往服务器的数据，存放在该缓冲区,缓冲区第一个字节存放数据长度
unsigned char *MQTT_TxDataInPtr;                   //指向发送缓冲区存放数据的位置
unsigned char *MQTT_TxDataOutPtr;                  //指向发送缓冲区读取数据的位置
unsigned char *MQTT_TxDataEndPtr;                  //指向发送缓冲区结束的位置

unsigned char  MQTT_CMDBuf[C_NUM][CBUFF_UNIT];     //命令数据的接收缓冲区
unsigned char *MQTT_CMDInPtr;                      //指向命令缓冲区存放数据的位置
unsigned char *MQTT_CMDOutPtr;                     //指向命令缓冲区读取数据的位置
unsigned char *MQTT_CMDEndPtr;                     //指向命令缓冲区结束的位置

char ClientID[128];                                //存放客户端ID的缓冲区
int  ClientID_len;                                 //存放客户端ID的长度

char Username[128];                                //存放用户名的缓冲区
int  Username_len;								   //存放用户名的长度

char Passward[128];                                //存放密码的缓冲区
int  Passward_len;								   //存放密码的长度

char ServerIP[128];                                //存放服务器IP或是域名
int  ServerPort;                                   //存放服务器的端口号

int   Fixed_len;                       			   //固定报头长度
int   Variable_len;                     		   //可变报头长度
int   Payload_len;                       		   //有效负荷长度
unsigned char  temp_buff[TBUFF_UNIT];			   //临时缓冲区，构建报文用

char pingFlag = 0;       //ping报文状态       0：正常状态，等待计时时间到，发送Ping报文
                         //ping报文状态       1：Ping报文已发送，当收到 服务器回复报文的后 将1置为0

MQTT_Threshold_t g_mqtt_threshold = {30, 80, 300}; //默认阈值：温度30，湿度80，光照300

#define THRESHOLD_EE_MAGIC_ADDR      0x10
#define THRESHOLD_EE_VER_ADDR        0x11
#define THRESHOLD_EE_TEMP_L_ADDR     0x12
#define THRESHOLD_EE_TEMP_H_ADDR     0x13
#define THRESHOLD_EE_HUMI_L_ADDR     0x14
#define THRESHOLD_EE_HUMI_H_ADDR     0x15
#define THRESHOLD_EE_LIGHT_L_ADDR    0x16
#define THRESHOLD_EE_LIGHT_H_ADDR    0x17
#define THRESHOLD_EE_CRC_ADDR        0x18

#define THRESHOLD_EE_MAGIC           0xA5
#define THRESHOLD_EE_VER             0x01

/*----------------------------------------------------------*/
/*函数名：threshold_crc_calc                                */
/*功  能：计算阈值配置在AT24C02中的校验值（异或校验）         */
/*说  明：用于判断EEPROM中的阈值数据是否被破坏                */
/*参  数：无                                                */
/*返回值：校验值（uint8_t）                                  */
/*----------------------------------------------------------*/
static uint8_t threshold_crc_calc(void)
{
	uint8_t crc;

	crc = THRESHOLD_EE_MAGIC ^ THRESHOLD_EE_VER;
	crc ^= AT24C_ReadByte(THRESHOLD_EE_TEMP_L_ADDR);
	crc ^= AT24C_ReadByte(THRESHOLD_EE_TEMP_H_ADDR);
	crc ^= AT24C_ReadByte(THRESHOLD_EE_HUMI_L_ADDR);
	crc ^= AT24C_ReadByte(THRESHOLD_EE_HUMI_H_ADDR);
	crc ^= AT24C_ReadByte(THRESHOLD_EE_LIGHT_L_ADDR);
	crc ^= AT24C_ReadByte(THRESHOLD_EE_LIGHT_H_ADDR);

	return crc;
}

/*----------------------------------------------------------*/
/*函数名：parse_json_int_by_key                             */
/*功  能：从JSON字符串中按键名提取整数值                     */
/*说  明：轻量级解析，不依赖cJSON，适合STM32资源受限场景      */
/*参  数：json_payload：原始JSON字符串                       */
/*参  数：key：要查找的键（例如"\"TempThreshold\""）        */
/*参  数：value：输出参数，返回解析出的整数值                */
/*返回值：1=找到并解析成功，0=未找到或解析失败               */
/*----------------------------------------------------------*/
static uint8_t parse_json_int_by_key(const char *json_payload, const char *key, int *value)
{
	const char *k;
	const char *colon;
	char *endptr;
	long v;

	if((json_payload == 0) || (key == 0) || (value == 0))
		return 0;

	k = strstr(json_payload, key);
	if(k == 0)
		return 0;

	colon = strchr(k, ':');
	if(colon == 0)
		return 0;

	colon++;
	while((*colon == ' ') || (*colon == '\t') || (*colon == '"'))
		colon++;

	v = strtol(colon, &endptr, 10);
	if(endptr == colon)
		return 0;

	*value = (int)v;
	return 1;
}

/*----------------------------------------------------------*/
/*函数名：clamp_int                                         */
/*功  能：将整数限制在指定范围内                             */
/*参  数：v：待处理数值                                     */
/*参  数：min_v：最小值                                     */
/*参  数：max_v：最大值                                     */
/*返回值：范围限制后的结果                                   */
/*----------------------------------------------------------*/
static int clamp_int(int v, int min_v, int max_v)
{
	if(v < min_v)
		return min_v;
	if(v > max_v)
		return max_v;
	return v;
}

/*----------------------------------------------------------*/
/*函数名：mqtt_encode_remaining_length                      */
/*功  能：按MQTT协议编码Remaining Length字段               */
/*参  数：buf：输出缓冲区                                   */
/*参  数：remaining_len：待编码长度                         */
/*返回值：编码后字节数                                      */
/*----------------------------------------------------------*/
static int mqtt_encode_remaining_length(unsigned char *buf, int remaining_len)
{
	int temp;
	int len;

	len = 0;
	do{
		temp = remaining_len % 128;
		remaining_len = remaining_len / 128;
		if(remaining_len > 0)
			temp |= 0x80;
		buf[len] = (unsigned char)temp;
		len++;
	}while(remaining_len > 0);

	return len;
}

/*----------------------------------------------------------*/
/*函数名：mqtt_decode_remaining_length                      */
/*功  能：按MQTT协议解码Remaining Length字段               */
/*参  数：buf：输入缓冲区                                   */
/*参  数：consumed：输出参数，返回占用字节数               */
/*返回值：解码后的长度                                      */
/*----------------------------------------------------------*/
static int mqtt_decode_remaining_length(const unsigned char *buf, int *consumed)
{
	int value;
	int multiplier;
	int temp;
	int len;

