33yes/FreeRTOS_stm32_esp8266_Env_Scan/Net/src/mqtt.c
	value = 0;
	multiplier = 1;
	len = 0;
	do{
		temp = buf[len];
		value += (temp & 127) * multiplier;
		multiplier *= 128;
		len++;
	}while((temp & 128) != 0);

	if(consumed != 0)
		*consumed = len;

	return value;
}

/*----------------------------------------------------------*/
/*函数名：初始化接收,发送,命令数据的 缓冲区 以及各状态参数  */
/*参  数：无                                                */
/*返回值：无                                                */
/*----------------------------------------------------------*/
void MQTT_Buff_Init(void)
{	
	MQTT_RxDataInPtr=MQTT_RxDataBuf[0]; 				 //指向发送缓冲区存放数据的指针归位
	MQTT_RxDataOutPtr=MQTT_RxDataInPtr; 				 //指向发送缓冲区读取数据的指针归位
	MQTT_RxDataEndPtr=MQTT_RxDataBuf[R_NUM-1];		     //指向发送缓冲区结束的指针归位
	
	MQTT_TxDataInPtr=MQTT_TxDataBuf[0];					 //指向发送缓冲区存放数据的指针归位
	MQTT_TxDataOutPtr=MQTT_TxDataInPtr;				     //指向发送缓冲区读取数据的指针归位
	MQTT_TxDataEndPtr=MQTT_TxDataBuf[T_NUM-1];           //指向发送缓冲区结束的指针归位
	
	MQTT_CMDInPtr=MQTT_CMDBuf[0];                        //指向命令缓冲区存放数据的指针归位
	MQTT_CMDOutPtr=MQTT_CMDInPtr;                        //指向命令缓冲区读取数据的指针归位
	MQTT_CMDEndPtr=MQTT_CMDBuf[C_NUM-1];              	 //指向命令缓冲区结束的指针归位

	MQTT_ConectPack();                                	 //发送缓冲区添加连接报文
	MQTT_ThresholdInit();
	
	pingFlag = 0;   //ping返回值清零
}

/*----------------------------------------------------------*/
/*函数名：云初始化参数，得到客户端ID，用户名和密码          */
/*参  数：无                                                */
/*返回值：无                                                */
/*----------------------------------------------------------*/
void IoT_parameter_init(void)
{	
	memset(ClientID,0,128);                              //客户端ID的缓冲区全部清零
	sprintf(ClientID,"%s",DEVICEID);                     //阿里云：ClientID通常使用DeviceName（可在main里给完整ClientID）
	ClientID_len = strlen(ClientID);                     //计算客户端ID的长度
	
	memset(Username,0,128);                              //用户名的缓冲区全部清零
	sprintf(Username,"%s&%s",DEVICEID,PRODUCTID);        //阿里云：DeviceName&ProductKey
	Username_len = strlen(Username);                     //计算用户名的长度
	
	memset(Passward,0,128);                              //用户名的缓冲区全部清零
	sprintf(Passward,"%s",AUTHENTICATION);               //构建密码，并存入缓冲区
	Passward_len = strlen(Passward);                     //计算密码的长度
	
	memset(ServerIP,0,128);  
	sprintf(ServerIP,"%s",SERVER_IP);              		//构建服务器域名
	ServerPort = SERVER_PORT;                           //服务器端口号
	
	printf("服 务 器：%s:%d\r\n",ServerIP,ServerPort);  
	printf("客户端ID：%s\r\n",ClientID);                
	printf("用 户 名：%s\r\n",Username);                 
	printf("密    码：%s\r\n",Passward);                 
}

/*----------------------------------------------------------*/
/*函数名：连接服务器报文                                    */
/*参  数：无                                                */
/*返回值：无                                                */
/*----------------------------------------------------------*/
void MQTT_ConectPack(void)
{	
	int Remaining_len;
	int topic_offset;
	
	Fixed_len = 1;                                                        //连接报文中，固定报头长度暂时先=1
	Variable_len = 10;                                                    //连接报文中，可变报头长度=10
	Payload_len = 2 + ClientID_len + 2 + Username_len + 2 + Passward_len; //连接报文中，负载长度      
	Remaining_len = Variable_len + Payload_len;                           //剩余长度=可变报头长度+负载长度
	
	temp_buff[0]=0x10;                    //固定报头第1个字节 ：固定0x01		
	Fixed_len += mqtt_encode_remaining_length(&temp_buff[1], Remaining_len);
	
	temp_buff[Fixed_len + 0] = 0x00;      //可变报头第1个字节 ：固定0x00	            
	temp_buff[Fixed_len + 1] = 0x04;      //可变报头第2个字节 ：固定0x04
	temp_buff[Fixed_len + 2] = 0x4D;	  //可变报头第3个字节 ：固定0x4D
	temp_buff[Fixed_len + 3] = 0x51;	  //可变报头第4个字节 ：固定0x51
	temp_buff[Fixed_len + 4] = 0x54;	  //可变报头第5个字节 ：固定0x54
	temp_buff[Fixed_len + 5] = 0x54;      //可变报头第6个字节 ：固定0x54
	temp_buff[Fixed_len + 6] = 0x04;	  //可变报头第7个字节 ：固定0x04
	temp_buff[Fixed_len + 7] = 0xC2;	  //可变报头第8个字节 ：使能用户名和密码校验，不使用遗嘱，不保留会话
	temp_buff[Fixed_len + 8] = 0x00; 	  //可变报头第9个字节 ：保活时间高字节 0x00
	temp_buff[Fixed_len + 9] = 0x64;	  //可变报头第10个字节：保活时间高字节 0x64   100s
	topic_offset = Fixed_len + 10;
	
	/*     CLIENT_ID      */
	temp_buff[topic_offset + 0] = ClientID_len/256;                			  	//客户端ID长度高字节
	temp_buff[topic_offset + 1] = ClientID_len%256;               			  	//客户端ID长度低字节
	memcpy(&temp_buff[topic_offset + 2],ClientID,ClientID_len);                 //复制过来客户端ID字串	
	/*     用户名        */
	temp_buff[topic_offset + 2 + ClientID_len] = Username_len/256; 				//用户名长度高字节
	temp_buff[topic_offset + 3 + ClientID_len] = Username_len%256; 				//用户名长度低字节
	memcpy(&temp_buff[topic_offset + 4 + ClientID_len],Username,Username_len);    //复制过来用户名字串	
	/*      密码        */
	temp_buff[topic_offset + 4 + ClientID_len + Username_len] = Passward_len/256;	//密码长度高字节
	temp_buff[topic_offset + 5 + ClientID_len + Username_len] = Passward_len%256;	//密码长度低字节
	memcpy(&temp_buff[topic_offset + 6 + ClientID_len + Username_len],Passward,Passward_len); //复制过来密码字串

	TxDataBuf_Deal(temp_buff, Fixed_len + Variable_len + Payload_len);      //加入发送数据缓冲区
}

/*----------------------------------------------------------*/
/*函数名：SUBSCRIBE订阅topic报文                            */
/*参  数：QoS：订阅等级                                     */
/*参  数：topic_name：订阅topic报文名称                     */
/*返回值：无                                                */
/*----------------------------------------------------------*/
void MQTT_Subscribe(char *topic_name, int QoS)
{	
	int topic_len;

	topic_len = strlen(topic_name);
	Fixed_len = 2;                              		   //SUBSCRIBE报文中，固定报头长度=2
	Variable_len = 2;                          			   //SUBSCRIBE报文中，可变报头长度=2	
	Payload_len = 2 + topic_len + 1;   		   //计算有效负荷长度 = 2字节(topic_name长度)+ topic_name字符串的长度 + 1字节服务等级
	
	temp_buff[0] = 0x82;                                   //第1个字节 ：固定0x82                      
	temp_buff[1] = Variable_len + Payload_len;             //第2个字节 ：可变报头+有效负荷的长度	
	temp_buff[2] = 0x00;                                   //第3个字节 ：报文标识符高字节，固定使用0x00
	temp_buff[3] = 0x01;		                           //第4个字节 ：报文标识符低字节，固定使用0x01
	temp_buff[4] = topic_len/256;                          //第5个字节 ：topic_name长度高字节
	temp_buff[5] = topic_len%256;		           //第6个字节 ：topic_name长度低字节
	memcpy(&temp_buff[6], topic_name, topic_len);          //第7个字节开始 ：复制过来topic_name字串		
	temp_buff[6 + topic_len] = QoS;                        //最后1个字节：订阅等级
	
	TxDataBuf_Deal(temp_buff, Fixed_len + Variable_len + Payload_len);  //加入发送数据缓冲区
}

/*----------------------------------------------------------*/
/*函数名：PING报文，心跳包                                   */
/*参  数：无                                                */
/*返回值：无                                                */
/*----------------------------------------------------------*/
void MQTT_PingREQ(void)
{
	temp_buff[0] = 0xC0;              //第1个字节 ：固定0xC0                      
	temp_buff[1] = 0x00;              //第2个字节 ：固定0x00 

	TxDataBuf_Deal(temp_buff, 2);     //加入数据到缓冲区
}

/*----------------------------------------------------------*/
/*函数名：等级0 发布消息报文                                */
/*参  数：topic_name：topic名称                             */
/*参  数：data：数据                                        */ 
/*参  数：data_len：数据长度                                */
/*返回值：无                                                */
/*----------------------------------------------------------*/
void MQTT_PublishQs0(const char *topic, char *data, int data_len)
{	
	int Remaining_len;
	int topic_len;
	
	topic_len = strlen(topic);
	Fixed_len = 1;                              //固定报头长度暂时先等于：1字节
	Variable_len = 2 + topic_len;               //可变报头长度：2字节(topic长度)+ topic字符串的长度
	Payload_len = data_len;                     //有效负荷长度：就是data_len
	Remaining_len = Variable_len + Payload_len; //剩余长度=可变报头长度+负载长度
	
	temp_buff[0] = 0x30;                      	//固定报头第1个字节 ：固定0x30   	
	Fixed_len += mqtt_encode_remaining_length(&temp_buff[1], Remaining_len);
		             
