33yes/FreeRTOS_stm32_esp8266_Env_Scan/Net/src/mqtt.c
	temp_buff[Fixed_len+0] = topic_len/256;                           //可变报头第1个字节     ：topic长度高字节
	temp_buff[Fixed_len+1] = topic_len%256;		                  //可变报头第2个字节     ：topic长度低字节
	memcpy(&temp_buff[Fixed_len+2], topic,topic_len);                 //可变报头第3个字节开始 ：拷贝topic字符串	
	memcpy(&temp_buff[Fixed_len + 2 + topic_len], data, data_len);    //有效负荷：拷贝data数据
	
	TxDataBuf_Deal(temp_buff, Fixed_len + Variable_len + Payload_len);//加入发送数据缓冲区	
}

/*----------------------------------------------------------*/
/*函数名：处理服务器发来的等级0的推送                       */
/*参  数：redata：接收的数据                                */
/*返回值：无                                                */
/*----------------------------------------------------------*/
void MQTT_DealPushdata_Qs0(unsigned char *redata)
{
	int  re_len;               	           //定义一个变量，存放接收的数据总长度
	int  pack_num;                         //定义一个变量，当多个推送一起过来时，保存推送的个数
    int  temp_len;                         //定义一个变量，暂存数据
    int  totle_len;                        //定义一个变量，存放已经统计的推送的总数据量
	int  topic_len;              	       //定义一个变量，存放推送中主题的长度
	int  cmd_len;                          //定义一个变量，存放推送中包含的命令数据的长度
	int  cmd_loca;                         //定义一个变量，存放推送中包含的命令的起始位置
	int  i;                                //定义一个变量，用于for循环
	int  local;
	unsigned char tempbuff[RBUFF_UNIT];	   //临时缓冲区
	unsigned char *data;                   //redata过来的时候，第一个字节是数据总量，data用于指向redata的第2个字节，真正的数据开始的地方
		
	re_len = redata[0] * 256 + redata[1];                 //获取接收的数据总长度		
	data = &redata[2];                                    //data指向redata的第2个字节，真正的数据开始的 
	pack_num = temp_len = totle_len = 0;                  //各个变量清零
	do{
		pack_num++;                                       //开始循环统计推送的个数，每次循环推送的个数+1	
		temp_len = mqtt_decode_remaining_length(&data[totle_len + 1], &local);
		totle_len += (temp_len + local + 1);              //累计统计的总的推送的数据长度
		re_len -= (temp_len + local + 1);                 //接收的数据总长度 减去 本次统计的推送的总长度
	}while(re_len!=0);                                    //如果接收的数据总长度等于0了，说明统计完毕了
	printf("本次接收了%d个推送数据\r\n", pack_num);		
	temp_len = totle_len = 0;                		      //各个变量清零
	for(i = 0; i < pack_num; i++)						  //已经统计到了接收的推送个数，开始for循环，取出每个推送的数据 
	{                                		
		temp_len = mqtt_decode_remaining_length(&data[totle_len + 1], &local);
		topic_len = data[totle_len + local + 1]*256 + data[totle_len + local + 2] + 2; //计算本次推送数据中主题占用的数据量
		cmd_len = temp_len - topic_len;                              			   //计算本次推送数据中命令数据占用的数据量
		cmd_loca = totle_len + local + topic_len + 1;               			   //计算本次推送数据中命令数据开始的位置
		if(cmd_len > RBUFF_UNIT)
			cmd_len = RBUFF_UNIT;
		memcpy(tempbuff, &data[cmd_loca], cmd_len);                   			   //命令数据拷贝出来		                 
		CMDBuf_Deal(tempbuff, cmd_len);                             			   //加入命令到缓冲区
		totle_len += (temp_len + local + 1);                         			   //累计已经统计的推送的数据长度
	}	
}

/*----------------------------------------------------------*/
/*函数名：处理发送缓冲区                                    */
/*参  数：data：数据                                        */
/*参  数：size：数据长度								    */
/*返回值：无                                                */
/*----------------------------------------------------------*/
void TxDataBuf_Deal(unsigned char *data, int size)
{
	memcpy(&MQTT_TxDataInPtr[2], data, size);     //拷贝数据到发送缓冲区	
	MQTT_TxDataInPtr[0] = size/256;               //记录数据长度
	MQTT_TxDataInPtr[1] = size%256;               //记录数据长度
	MQTT_TxDataInPtr += TBUFF_UNIT;               //指针下移
	if(MQTT_TxDataInPtr == MQTT_TxDataEndPtr)     //如果指针到缓冲区尾部了
		MQTT_TxDataInPtr = MQTT_TxDataBuf[0];     //指针归位到缓冲区开头
}

/*----------------------------------------------------------*/
/*函数名：处理命令缓冲区									*/
/*参  数：data：数据                                        */
/*参  数：size：数据长度                                    */
/*返回值：无                                                */
/*----------------------------------------------------------*/
void CMDBuf_Deal(unsigned char *data, int size)
{
	if(size > (CBUFF_UNIT - 3))
		size = CBUFF_UNIT - 3;

	memcpy(&MQTT_CMDInPtr[2], data,size);         //拷贝数据到命令缓冲区
	MQTT_CMDInPtr[0] = size/256;              	  //记录数据长度
	MQTT_CMDInPtr[1] = size%256;                  //记录数据长度
	MQTT_CMDInPtr[size+2] = '\0';                 //加入字符串结束符
	MQTT_CMDInPtr += CBUFF_UNIT;               	  //指针下移
	if(MQTT_CMDInPtr == MQTT_CMDEndPtr)           //如果指针到缓冲区尾部了
		MQTT_CMDInPtr = MQTT_CMDBuf[0];        	  //指针归位到缓冲区开头
}

/*----------------------------------------------------------*/
/*函数名：MQTT_ThresholdInit                                */
/*功  能：初始化阈值配置                                     */
/*说  明：优先从AT24C02读取阈值；若读取失败，写入默认值       */
/*参  数：无                                                */
/*返回值：无                                                */
/*----------------------------------------------------------*/
void MQTT_ThresholdInit(void)
{
	if(MQTT_LoadThresholdFromAT24C02() != 0)
	{
		g_mqtt_threshold.temperature_threshold = 30;
		g_mqtt_threshold.humidity_threshold = 80;
		g_mqtt_threshold.light_threshold = 300;
		MQTT_SaveThresholdToAT24C02();
	}
}

/*----------------------------------------------------------*/
/*函数名：MQTT_LoadThresholdFromAT24C02                     */
/*功  能：从AT24C02读取温湿度/光照阈值                       */
/*说  明：会检查magic/version/CRC和数值范围                 */
/*参  数：无                                                */
/*返回值：0成功，非0失败                                    */
/*----------------------------------------------------------*/
uint8_t MQTT_LoadThresholdFromAT24C02(void)
{
	uint8_t magic;
	uint8_t ver;
	uint8_t crc_s;
	uint8_t crc_c;
	int16_t t;
	int16_t h;
	uint16_t l;

	magic = AT24C_ReadByte(THRESHOLD_EE_MAGIC_ADDR);
	ver = AT24C_ReadByte(THRESHOLD_EE_VER_ADDR);
	if((magic != THRESHOLD_EE_MAGIC) || (ver != THRESHOLD_EE_VER))
		return 1;

	crc_s = AT24C_ReadByte(THRESHOLD_EE_CRC_ADDR);
	crc_c = threshold_crc_calc();
	if(crc_s != crc_c)
		return 2;

	t = (int16_t)((AT24C_ReadByte(THRESHOLD_EE_TEMP_H_ADDR) << 8) | AT24C_ReadByte(THRESHOLD_EE_TEMP_L_ADDR));
	h = (int16_t)((AT24C_ReadByte(THRESHOLD_EE_HUMI_H_ADDR) << 8) | AT24C_ReadByte(THRESHOLD_EE_HUMI_L_ADDR));
	l = (uint16_t)((AT24C_ReadByte(THRESHOLD_EE_LIGHT_H_ADDR) << 8) | AT24C_ReadByte(THRESHOLD_EE_LIGHT_L_ADDR));

	if((t < -40) || (t > 125) || (h < 0) || (h > 100) || (l > 20000))
		return 3;

	g_mqtt_threshold.temperature_threshold = t;
	g_mqtt_threshold.humidity_threshold = h;
	g_mqtt_threshold.light_threshold = l;

