33yes/FreeRTOS_stm32_esp8266_Env_Scan/Net/src/mqtt.c
	return 0;
}

/*----------------------------------------------------------*/
/*函数名：MQTT_SaveThresholdToAT24C02                       */
/*功  能：把当前阈值写入AT24C02                             */
/*说  明：写入完成后同步更新CRC字节                          */
/*参  数：无                                                */
/*返回值：0成功，非0失败                                    */
/*----------------------------------------------------------*/
uint8_t MQTT_SaveThresholdToAT24C02(void)
{
	uint8_t ret;
	uint8_t crc;
	uint16_t t;
	uint16_t h;

	t = (uint16_t)g_mqtt_threshold.temperature_threshold;
	h = (uint16_t)g_mqtt_threshold.humidity_threshold;

	ret = 0;
	ret |= AT24C_WriteByte(THRESHOLD_EE_MAGIC_ADDR, THRESHOLD_EE_MAGIC);
	ret |= AT24C_WriteByte(THRESHOLD_EE_VER_ADDR, THRESHOLD_EE_VER);
	ret |= AT24C_WriteByte(THRESHOLD_EE_TEMP_L_ADDR, (uint8_t)(t & 0xFF));
	ret |= AT24C_WriteByte(THRESHOLD_EE_TEMP_H_ADDR, (uint8_t)((t >> 8) & 0xFF));
	ret |= AT24C_WriteByte(THRESHOLD_EE_HUMI_L_ADDR, (uint8_t)(h & 0xFF));
	ret |= AT24C_WriteByte(THRESHOLD_EE_HUMI_H_ADDR, (uint8_t)((h >> 8) & 0xFF));
	ret |= AT24C_WriteByte(THRESHOLD_EE_LIGHT_L_ADDR, (uint8_t)(g_mqtt_threshold.light_threshold & 0xFF));
	ret |= AT24C_WriteByte(THRESHOLD_EE_LIGHT_H_ADDR, (uint8_t)((g_mqtt_threshold.light_threshold >> 8) & 0xFF));

	crc = threshold_crc_calc();
	ret |= AT24C_WriteByte(THRESHOLD_EE_CRC_ADDR, crc);

	return ret;
}

/*----------------------------------------------------------*/
/*函数名：MQTT_ParseAliyunThresholdJson                     */
/*功  能：解析阿里云下发JSON并更新本地阈值                   */
/*说  明：支持多个字段名别名，更新成功后自动写入AT24C02       */
/*参  数：json_payload：云端下发的JSON字符串                 */
/*返回值：1有更新，0无更新                                   */
/*----------------------------------------------------------*/
uint8_t MQTT_ParseAliyunThresholdJson(const char *json_payload)
{
	int v;
	uint8_t updated;

	updated = 0;
	if(json_payload == 0)
		return 0;

	if(parse_json_int_by_key(json_payload, "\"temperature_threshold\"", &v) ||
	   parse_json_int_by_key(json_payload, "\"TemperatureThreshold\"", &v) ||
	   parse_json_int_by_key(json_payload, "\"TempThreshold\"", &v))
	{
		g_mqtt_threshold.temperature_threshold = (int16_t)clamp_int(v, -40, 125);
		updated = 1;
	}

	if(parse_json_int_by_key(json_payload, "\"humidity_threshold\"", &v) ||
	   parse_json_int_by_key(json_payload, "\"HumidityThreshold\"", &v) ||
	   parse_json_int_by_key(json_payload, "\"HumiThreshold\"", &v))
	{
		g_mqtt_threshold.humidity_threshold = (int16_t)clamp_int(v, 0, 100);
		updated = 1;
	}

	if(parse_json_int_by_key(json_payload, "\"light_threshold\"", &v) ||
	   parse_json_int_by_key(json_payload, "\"LightThreshold\"", &v) ||
	   parse_json_int_by_key(json_payload, "\"IlluminanceThreshold\"", &v))
	{
		g_mqtt_threshold.light_threshold = (uint16_t)clamp_int(v, 0, 20000);
		updated = 1;
	}

	if(updated)
		MQTT_SaveThresholdToAT24C02();

	return updated;
}

/*----------------------------------------------------------*/
/*函数名：MQTT_ProcessAliyunThresholdCommand                */
/*功  能：处理命令缓冲区头部的一条阈值命令                   */
/*说  明：处理后无论成功与否都会将命令出队，避免阻塞后续命令   */
/*参  数：无                                                */
/*返回值：1有更新，0无更新                                   */
/*----------------------------------------------------------*/
uint8_t MQTT_ProcessAliyunThresholdCommand(void)
{
	uint8_t updated;

	if(MQTT_CMDOutPtr == MQTT_CMDInPtr)
		return 0;

	updated = MQTT_ParseAliyunThresholdJson((const char *)&MQTT_CMDOutPtr[2]);

	MQTT_CMDOutPtr += CBUFF_UNIT;
	if(MQTT_CMDOutPtr == MQTT_CMDEndPtr)
		MQTT_CMDOutPtr = MQTT_CMDBuf[0];

	return updated;
}
